KCX-Mapping-Convert/testdaten/EMCS/UIDSfromKidsReferences/EMCSValidDeclarationUids.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Header>
<Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true">
<To>DE01.CSFALT.2144</To>
<From>DE01.CSFALT.2144</From>
<MessageID>EI20100519</MessageID><SentAt>2010-05-19 12:02:00 +0200</SentAt>
<Act>request</Act>
<MessageType>EMCSValidDeclaration</MessageType>
<MessageVersion>1.0</MessageVersion>
</Header></soap:Header>
<soap:Body>
<Submit xmlns="http://www.eurtradenet.com/schemas/uids/export/body/200601">
<EMCS>
<EMCSValidDeclaration><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><DeliveryPlaceCustomsOffice>AA000000</DeliveryPlaceCustomsOffice><ExciseMovementEaad><AadReferenceCode>AadReferenceCode</AadReferenceCode><DateAndTimeOfValidationOfEaad>2010-05-19 14:55:00 +0200</DateAndTimeOfValidationOfEaad></ExciseMovementEaad><DispatchImportOffice>AA000000</DispatchImportOffice><DeliveryPlaceCustomsOffice>AA000000</DeliveryPlaceCustomsOffice><CompetentAuthorityDispatchOffice>CompetentAuthorityDispatchOffice</CompetentAuthorityDispatchOffice><HeaderEaad><SequenceNumber>8</SequenceNumber><DestinationTypeCode>1</DestinationTypeCode><JourneyTime>H00</JourneyTime><TransportArrangement>1</TransportArrangement></HeaderEaad><EaadDraft><InvoiceNumber>InvoiceNumber</InvoiceNumber><InvoiceDate>1967-08-13</InvoiceDate><OriginTypeCode>1</OriginTypeCode><DateOfDispatch>1967-08-13</DateOfDispatch><TimeOfDispatch>14:20:00</TimeOfDispatch><ImportSad>ImportSad1</ImportSad><ImportSad>ImportSad2</ImportSad></EaadDraft><ConsignorTrader><CustomerID>CustomerID-Consignor</CustomerID><VATID>VATID-Consignor</VATID><Address><Name>NameConsignor</Name><StreetAndNumber>StreetAndNumber-Consignor</StreetAndNumber><PostalCode>PostalCode-Consignor</PostalCode><City>City-Consignor</City><CountryCodeISO>CR</CountryCodeISO></Address></ConsignorTrader><PlaceOfDispatchTrader><CustomerID>CustomerID-PD</CustomerID><VATID>VATID-PD</VATID><Address><Name>Name-PD</Name><StreetAndNumber>StreetAndNumber-PD</StreetAndNumber><PostalCode>PostalCode-PD</PostalCode><City>City-PD</City><CountryCodeISO>PD</CountryCodeISO></Address></PlaceOfDispatchTrader><ConsigneeTrader><CustomerID>CustomerID-Consignee</CustomerID><VATID>VATID-Consignee</VATID><Address><Name>Name-Consignee</Name><StreetAndNumber>StreetAndNumber-Consignee</StreetAndNumber><PostalCode>PostalCode-Consignee</PostalCode><City>City-Consignee</City><CountryCodeISO>CE</CountryCodeISO></Address></ConsigneeTrader><ComplementConsigneeTrader><MemberStateCode>MSC</MemberStateCode><CertificateOfExemption>CertificateOfExemption</CertificateOfExemption></ComplementConsigneeTrader><DeliveryPlaceTrader><CustomerID>CustomerID-DP</CustomerID><VATID>VATID-DP</VATID><Address><Name>Name</Name><StreetAndNumber>StreetAndNumber-DP</StreetAndNumber><PostalCode>PostalCode-DP</PostalCode><City>City-DP</City><CountryCodeISO>DP</CountryCodeISO></Address></DeliveryPlaceTrader><MovementGuarantee><GuarantorTypeCode>0</GuarantorTypeCode><GuarantorTrader><CustomerID>CustomerID2</CustomerID><VATID>VATID2</VATID><Address><Name>Name2</Name><StreetAndNumber>StreetAndNumber2</StreetAndNumber><PostalCode>PostalCode2</PostalCode><City>City2</City><CountryCodeISO>DE2</CountryCodeISO></Address></GuarantorTrader></MovementGuarantee><TransportMode>0</TransportMode><TransportArrangerTrader><CustomerID>CustomerID-TA</CustomerID><VATID>VATID-TA</VATID><Address><Name>Name-TA</Name><StreetAndNumber>StreetAndNumber-TA</StreetAndNumber><PostalCode>PostalCode-TA</PostalCode><City>City-TA</City><CountryCodeISO>TA</CountryCodeISO></Address></TransportArrangerTrader><FirstTransporterTrader><CustomerID>CustomerID-FT</CustomerID><VATID>VATID-FT</VATID><Address><Name>Name-FT</Name><StreetAndNumber>StreetAndNumber-FT</StreetAndNumber><PostalCode>PostalCode-FT</PostalCode><City>City-FT</City><CountryCodeISO>FT</CountryCodeISO></Address></FirstTransporterTrader><TransportDetails><TransportUnitCode>1</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits1</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification1</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation1</ComplementaryInformation><SealInformation language="AA">SealInformation1</SealInformation></TransportDetails><TransportDetails><TransportUnitCode>2</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits2</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification2</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation2</ComplementaryInformation><SealInformation language="AA">SealInformation2</SealInformation></TransportDetails><BodyEaad><ItemNumber>1</ItemNumber><ExciseProductCode>A000</ExciseProductCode><CnCode>00000000</CnCode><ArticleNumber>11111</ArticleNumber><CommercialDescription language="AA">CommercialDescription</CommercialDescription><DesignationOfOrigin language="AA">DesignationOfOrigin</DesignationOfOrigin><BrandNameOfProducts language="AA">BrandNameOfProducts</BrandNameOfProducts><FiscalMarkUsedFlag>0</FiscalMarkUsedFlag><FiscalMark language="AA">FiscalMark</FiscalMark><Quantity>0</Quantity><AlcoholicStrength>0</AlcoholicStrength><DegreePlato>0</DegreePlato><SizeOfProducer>0</SizeOfProducer><Density>0</Density><NetWeight>0</NetWeight><GrossWeight>0</GrossWeight><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>1</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>2</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>3</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>4</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><WineProduct><WineProductCategory>1</WineProductCategory><WineGrowingZoneCode>0</WineGrowingZoneCode><ThirdCountryOfOrigin>AA</ThirdCountryOfOrigin><OtherInformation language="AA">OtherInformation</OtherInformation><WineOperation>0</WineOperation></WineProduct></BodyEaad><BodyEaad><ItemNumber>2</ItemNumber><ExciseProductCode>A000</ExciseProductCode><CnCode>00000000</CnCode><ArticleNumber>22222</ArticleNumber><CommercialDescription language="AA">CommercialDescription</CommercialDescription><DesignationOfOrigin language="AA">DesignationOfOrigin</DesignationOfOrigin><BrandNameOfProducts language="AA">BrandNameOfProducts</BrandNameOfProducts><FiscalMarkUsedFlag>0</FiscalMarkUsedFlag><FiscalMark language="AA">FiscalMark</FiscalMark><Quantity>0</Quantity><AlcoholicStrength>0</AlcoholicStrength><DegreePlato>0</DegreePlato><SizeOfProducer>0</SizeOfProducer><Density>0</Density><NetWeight>0</NetWeight><GrossWeight>0</GrossWeight><Package><KindOfPackages>aa</KindOfPackages><NumberOfPackages>1</NumberOfPackages><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><SealInformation language="AA">SealInformation</SealInformation></Package><WineProduct><WineProductCategory>1</WineProductCategory><WineGrowingZoneCode>0</WineGrowingZoneCode><ThirdCountryOfOrigin>AA</ThirdCountryOfOrigin><OtherInformation language="AA">OtherInformation</OtherInformation><WineOperation>0</WineOperation></WineProduct></BodyEaad><DocumentCertificate><DocumentDescription language="AA">DocumentDescription1</DocumentDescription><ReferenceOfDocument language="AA">ReferenceOfDocument1</ReferenceOfDocument></DocumentCertificate><DocumentCertificate><DocumentDescription language="BB">DocumentDescription2</DocumentDescription><ReferenceOfDocument language="BB">ReferenceOfDocument2</ReferenceOfDocument></DocumentCertificate></EMCSValidDeclaration></EMCS></Submit></soap:Body></soap:Envelope>

